PhysicalPropertyParams = {
    "borehole": ['B', 1],
    "depth": ['C', 2],
    "rs": ['P', 15],
    "r": ['Q', 16],
    "rd": ['R', 17],
    "n": ['S', 18],
    "e": ['T', 19],
    "W": ['U', 20],
    "Sr": ['V', 21],
    "Wl": ['W', 22],
    "Wp": ['X', 23],
    "Ip": ['Y', 24],
    "Il": ['Z', 25],
    "Ir": ['AE', 30],
    "Kf_min": ['AA', 26],
    "Kf_max": ['AB', 27],
    "rd_min": ['AC', 28],
    "rd_max": ['AD', 29],
    "slope_angle_dry": ['AF', 31],
    "slope_angle_wet": ['AG', 32],
    "ground_name": ['D', 3],
    "granulometric_10": ['E', 4],
    "granulometric_5": ['F', 5],
    "granulometric_2": ['G', 6],
    "granulometric_1": ['H', 7],
    "granulometric_05": ['I', 8],
    "granulometric_025": ['J', 9],
    "granulometric_01": ['K', 10],
    "granulometric_005": ['L', 11],
    "granulometric_001": ['M', 12],
    "granulometric_0002": ['N', 13],
    "granulometric_0000": ['O', 14],
}

GroundTypes = {
    1: "Песок гравелистый",
    2: "Песок крупный",
    3: "Песок средней крупности",
    4: "Песок мелкий",
    5: "Песок пылеватый",
    6: "Супесь песчанистая",
    7: "Супесь пылеватая",
    8: "Суглинок легкий песчанистый",
    9: "Суглинок легкий пылеватый",
    10: "Суглинок тяжелый песчанистый",
    11: "Суглинок тяжелый пылеватый",
    12: "Глина легкая песчанистая",
    13: "Глина легкая пылеватая",
    14: "Глина тяжелая",
    15: "Супесь, суглинок, глина с галькой (щебнем), с гравием (дресвой) или ракушкой",
    16: "Супесь, суглинок, глина галечниковые (щебенистые), гравелистые (дресвяные) или ракушечные",
    17: "Супесь",
    18: "Суглинок",
    19: "Глина",
    20: "Торф",
}


GroundTypesA = {
    1: "Песок",
    2: "Супесь",
    3: "Суглинок",
    4: "Глина",
    5: "Торф",
}

GroundTypes_B1 = {
    1: "гравелистый",
    2: "крупный",
    3: "средней крупности",
    4: "мелкий",
    5: "пылеватый"
}

GroundTypes_B2 = {
    1: "песчанистая",
    2: "пылеватая"
}

GroundTypes_B3 = {
    1: "легкий песчанистый",
    2: "легкий пылеватый",
    3: "тяжелый песчанистый",
    4: "тяжелый пылеватый"
}

GroundTypes_B4 = {
    1: "Глина легкая песчанистая",
    2: "Глина легкая пылеватая",
    3: "Глина тяжелая",
}

GroundTypes_C1 = {
    1: "Плотный",
    2: "Средней плотности",
    3: "Рыхлый",
}

GroundTypes_C2 = {
    1: "Твердая",
    2: "Пластичная",
    3: "Текучая",
}

GroundTypes_C3 = {
    1: "Твердый",
    2: "Полутвердый",
    3: "Тугопластичный",
    4: "Мягкопластичный",
    5: "Текучепластичный",
    6: "Текучий",
}

GroundTypes_C4 = {
    1: "Твердая",
    2: "Полутвердая",
    3: "Тугопластичная",
    4: "Мягкопластичная",
    5: "Текучепластичная",
    6: "Текучая",
}